<?php
$number = 10; //длина пароля 
//массив символов которые должны быть в генерации пароля 
$arr = array(
  'a', 'b', 'c', 'd', 'e', 'f',
  'g', 'h', 'i', 'j', 'k', 'l',
  'm', 'n', 'o', 'p', 'r', 's',
  't', 'u', 'v', 'x', 'y', 'z',
  '1', '2', '3', '4', '5', '6',
  '7', '8', '9', '0', '_', '-',
  'A', 'B', 'C', 'D', 'E', 'F',
  'G', 'H', 'I', 'G', 'K', 'L',
  'M', 'N', 'O', 'P', 'R', 'S',
  'T', 'U', 'V', 'X', 'Y', 'Z'
);
// Генерируем пароль
$pass = "";
for ($i = 0; $i < $number; $i++) {
  // Вычисляем случайный индекс массива
  $index = rand(0, count($arr) - 1);
  $pass .= $arr[$index];
}
echo $pass; //вывод пароля 
